Script started on Mon 24 Jun 2013 05:29:49 PM CDT
]0;ka-son@kason-Lenovo-IdeaPad-S300: ~/Documents/Java/LinkedListQueueka-son@kason-Lenovo-IdeaPad-S300:~/Documents/Java/LinkedListQueue$ make QueueDemo
javac -Xlint QueueDemo.java
]0;ka-son@kason-Lenovo-IdeaPad-S300: ~/Documents/Java/LinkedListQueueka-son@kason-Lenovo-IdeaPad-S300:~/Documents/Java/LinkedListQueue$ make Queue[K[K[K[K[Krun
java QueueDemo
Command> empty
true
Command> front
Queue is empty.
Command> back
Queue is empty.
Command> display
Queue is empty.
Command> enqueue
Integer> 1
String> 1
Enqueued 1, 1
Command> enqueue
Integer> 2
String> 2
Enqueued 2, 2
Command> display
1
1
2
2
Command> front
1
1
Command> back
2
2
Command> dequeue
Dequeued
Command> display
2
2
Command> dequeue
Dequeued
Command> display
Queue is empty.
Command> dequeue
Queue is empty.
Command> front
Queue is empty.
Command> back
Queue is empty.
Command> exit
]0;ka-son@kason-Lenovo-IdeaPad-S300: ~/Documents/Java/LinkedListQueueka-son@kason-Lenovo-IdeaPad-S300:~/Documents/Java/LinkedListQueue$ exit
exit

Script done on Mon 24 Jun 2013 05:31:11 PM CDT
