Script started on Sat 08 Jun 2013 05:25:06 PM CDT
]0;ka-son@kason-Lenovo-IdeaPad-S300: ~/Documents/Java/LinkedListQueueka-son@kason-Lenovo-IdeaPad-S300:~/Documents/Java/LinkedListQueue$ make clean Queue
rm -f *.class
javac -Xlint Queue.java QueueDemo.java
]0;ka-son@kason-Lenovo-IdeaPad-S300: ~/Documents/Java/LinkedListQueueka-son@kason-Lenovo-IdeaPad-S300:~/Documents/Java/LinkedListQueue$ java QueueDemo
Command> empty
true
Command> dies  splay
Queue is empty.
Command> enqueue
Integer> 1
String> Kason
Enqueued 1, Kason
Command> empty
false
Command> display
1
Kason
Command> enqueue
Integer> Os  2
String> Osborn
Enqueued 2, Osborn
Command> enqueue
Integer> Con   5
String> Connor
Enqueued 5, Connor
Command> enqueue
Integer> 10  6
String> Bernice
Enqueued 6, Bernice
Command> enqueue
Integer> 19
String> Dickson
Enqueued 19, Dickson
Command> display
1
Kason
2
Osborn
5
Connor
6
Bernice
19
Dickson
Command> dequeue
Dequeued
Command> display
2
Osborn
5
Connor
6
Bernice
19
Dickson
Command> dequeue
Dequeued
Command> display
5
Connor
6
Bernice
19
Dickson
Command> front
5
Connor
Command> back
19
Dickson
Command> dequeue
Dequeued
Command> dequeue
Dequeued
Command> display
19
Dickson
Command> front
19
Dickson
Command> back
19
Dickson
Command> dequeue
Dequeued
Command> front
Queue is empty.
Command> back
Queue is empty.
Command> dequeue
Queue is empty.
Command> empty
true
Command> exit
]0;ka-son@kason-Lenovo-IdeaPad-S300: ~/Documents/Java/LinkedListQueueka-son@kason-Lenovo-IdeaPad-S300:~/Documents/Java/LinkedListQueue$ exit
exit

Script done on Sat 08 Jun 2013 05:27:20 PM CDT
